{
    "vishnu": [
        {
            "id": 1,
            "name": "Matsya",
            "image": "Matsya-avatar.png",
            "books": "https://books.google.co.in/books?id=yS1AAQAAIAAJ&q=matsya+consort&redir_esc=y",
            "yug": "Satya yug",
            "temples": "Chennakeshava Temple",
            "sloka": "Om Namo Bhagavate Matsya Devaya",
            "festival": "Matsya Jayanti",
            "about": "Matsya is said to be the avatar that rescued the first man, as well as other creatures of the earth, from a great flood. Matsya is sometimes depicted as a great fish or as a human torso connected to the tail of a fish."
        },
        {
            "id": 2,
            "name": "Kurma",
            "image": "Kurma-avatar.png",
            "books": "https://en.wikipedia.org/wiki/Naradiya_Purana",
            "yug": "Satya yug",
            "temples": "Kurma Temple,srikurmam,Andhra pradesh",
            "sloka": "Om Namo Bhagavate Akuparaya Sarvashakti Svarupine Namah",
            "festival": "Kurma Jayanti on the full moon day of Vaisakha month",
            "about": "Kurma or Kūrma is the second avatar of the Hindu god Vishnu, who took the form of a giant tortoise to support the churning of the ocean of milk, a cosmic event that produced many divine items, including the elixir of immortality."
        },
        {
            "id": 3,
            "name": "Vamana",
            "image": "Vamana-avatar.png",
            "books": "https://www.britannica.com/topic/Vamana",
            "yug": "Treta yug",
            "temples": "Vamana Temple in Khajuraho,Madhya Pradesh",
            "sloka": "Om Namo Bhagavate Vasudevaya Namah",
            "festival": "Onam in Kerala",
            "about": "Vamana or Vāmana is the fifth avatar of the Hindu god Vishnu, who took the form of a dwarf Brahmin to subdue the demon king Bali, who had conquered the three worlds of earth, heaven and the space between them. Vamana asked Bali for as much land as he could cover in three steps, and then expanded himself to cover the entire universe in two steps, leaving Bali only the underworld."
        },
        {
            "id": 4,
            "name": "Varaha",
            "image": "Varaha-avatar.png",
            "books": "https://www.templepurohit.com/varaha-avatar-story/",
            "yug": "Satya yug",
            "temples": "Varahaperumal Temple,kumbakonam,Tamilnadu",
            "sloka": "Om Namo Narayanaya Namah",
            "festival": "Varaha Jayanti",
            "about": "Varaha or Varāha is the third avatar of the Hindu god Vishnu, who took the form of a wild boar to save the earth from a demon named Hiranyaksha. Varaha fought with the demon for a thousand years and lifted the earth out of the cosmic ocean with his tusks."
        },
        {
            "id": 5,
            "name": "Parsuram",
            "image": "Parsuram-avatar.png",
            "books": "https://bing.com/search?q=Parasuram+avatar",
            "yug": "Treta yug",
            "temples": "Parshuram Temple in Chiplun, Maharashtra",
            "sloka": "Om Namo Bhagavate Vasudevaya Namah",
            "festival": "Parashurama Jayanti,Parshuram Kund Mela",
            "about": "Parashurama or Paraśurāma is the sixth avatar of the Hindu god Vishnu. He is also known as Rama Jamadagnya, Rama Bhargava and Veerarama. He is a Brahmin warrior who wielded an axe and fought against the oppressive Kshatriyas, the ruling class."
        },
        {
            "id": 6,
            "name": "Balaram",
            "image": "Balaram-avatar.png",
            "books": "Balarama: A Royal Tale,Balarama in Hindu and Jain Mythology",
            "yug": "Dwapar yug",
            "temples": "Baladevjew Temple in Kendrapara, Odisha",
            "sloka": "Om Namo Bhagavate Vasudevaya Namah",
            "festival": "Balaram Jayanti",
            "about": "Balaram or Baladeva is a Hindu god and the elder brother of Krishna. He is sometimes considered as the eighth avatar of Vishnu, the supreme god.He is known for his strength, courage, loyalty, and devotion to Krishna. He is usually depicted as a fair-skinned man with a plow or a mace as his weapon."
        },
        {
            "id": 7,
            "name": "Ram",
            "image": "Ram-avatar.png",
            "books": "Asura, Tale of the Vanquished,names of Gods by Ram Swarup",
            "yug": "Treta yug",
            "temples": "Ram Mandir in Ayodhya, Uttar Pradesh",
            "sloka": "Shri Ram Jai Ram Jai Jai Ram",
            "festival": "Rama Navami",
            "about": "Ram or Rama is the seventh avatar of the Hindu god Vishnu. He is the hero of the epic Ramayana, which narrates his life story, his exile, his battle with the demon king Ravana, and his return to his kingdom. He is revered as an ideal king, a righteous warrior, a loyal husband, and a devoted son."
        },
        {
            "id": 8,
            "name": "Krishna",
            "image": "Krishna-avatar.png",
            "books": "Bhagavad Gita, Mahabharata, Srimad Bhagavatam, Harivamsa, Vishnu Purana, etc.",
            "yug": "Dwapar yug",
            "temples": "Banke Bihari Temple - Vrindavan,Dwarakadheesh Temple - Gujarat",
            "sloka": "Yada Yada Hi Dharmasya, Glanirva Bhavathi Bharatha, Abhyuthanam Adharmasya, Tadatmanam Srijami Aham. Paritranaya Sadhunam, Vinashaya Cha Dushkritam, Dharma Samsthapanarthaya, Sambhavami Yuge Yuge.",
            "festival": "Janmashtami",
            "about": "Krishna is a major Hindu god who is worshipped as the eighth incarnation of Vishnu and also as the supreme god in his own right. He is the hero of the epic Mahabharata and the speaker of the Bhagavad Gita, the sacred scripture of Hinduism."
        },
        {
            "id": 9,
            "name": "Narsimha",
            "image": "Narasimha-avatar.png",
            "books": "Srimad Bhagavatam, Vishnu Purana, Narasimha Purana, Agni Purana, etc.",
            "yug": "Satya yug",
            "temples": "Ahobilam, Simhachalam, Mangalagiri, Yadagirigutta",
            "sloka": "Sri Narasimha Maha Mantra: Ugram Viram Maha Vishnum Jvalantam Sarvato Mukham Nrisimham Bhishanam Bhadram Mrityur Mrityum Namamy Aham",
            "festival": "Narasimha Jayanti",
            "about": "He appeared to slay the demon king Hiranyakashipu, who had obtained a boon from Brahma that he could not be killed by human or animal, inside or outside, by day or night, on earth or the stars, with a weapon either living or inanimate."
        },
        {
            "id": 10,
            "name": "Kalki",
            "image": "Kalki-avatar.png",
            "books": "Srimad Bhagavatam, Vishnu Purana, Matsya Purana, Garuda Purana",
            "yug": "Kaliyug",
            "temples": "Kalki Temple in Jaipur, Rajasthan",
            "sloka": "Sri Kalki Maha Mantra: Om Devaki Sudha Govinda Vasudeva Jagatpate Dehime Tanayam Krishna Tvaamaham Sharanam Gatah",
            "festival": "Kalki Jayanti: The last day of the Shravana month",
            "about": "He is the tenth and final avatar of Lord Vishnu and has a human form with a white horse and a fiery sword.He will appear at the end of the Kali Yuga, when dharma and virtue have disappeared and the world is ruled by the unjust."
        }
    ],
    "folder": "./IMG/Avatars/",
    "count": 10,
    "shiva": [
        {
            "id": 1,
            "name": "Piplaad",
            "image": "Piplaad.jpg",
            "books": null,
            "temples": [
                "Shani Temple in Kokilavan",
                "Piplaad Temple in Ujjain"
            ],
            "yug": "Satya Yuga",
            "sloka": null,
            "festival": "Shani Jayanti",
            "about": "Lord Shiva took birth as Piplaad to avenge his father’s death caused by Shani. He cursed Shani to fall from the sky and later forgave him on the condition that he would not harm anyone below 16 years of age."
        },
        {
            "id": 2,
            "name": "Nandi",
            "image": "Nandi.png",
            "books": null,
            "temples": [
                "Nandi Temple in Karnataka",
                "Nandikeshwar Temple in Uttarakhand"
            ],
            "yug": "Satya Yuga",
            "sloka": null,
            "festival": "Nandikeshwar Jayanti",
            "about": "Lord Shiva took birth as Nandi to the sage Shilada, who performed penance to get a son. Nandi was an ardent devotee of Shiva and became his vehicle and gatekeeper. He also received the knowledge of Agamic and Tantric wisdom from Shiva."
        },
        {
            "id": 3,
            "name": "Veerabhadra",
            "books": null,
            "image": "Veerbhadra.png",
            "temples": [
                "Veerabhadra Temple in Lepakshi",
                "Veerabhadra Swamy Temple in Telangana"
            ],
            "yug": "Treta Yuga",
            "sloka": null,
            "festival": "Veerabhadra Jayanti",
            "about": "Lord Shiva created Veerabhadra from his lock of hair to destroy the sacrifice of Daksha, who insulted his wife Sati. Veerabhadra, along with Kali and other fierce beings, wreaked havoc on the ceremony and beheaded Daksha."
        },
        {
            "id": 4,
            "name": "Kaal Bhairava",
            "books": null,
            "image": "kalbhairava.jpg",
            "temples": [
                "Kaal Bhairav Temple in Varanasi",
                "Bhairav Nath Temple in Nepal"
            ],
            "yug": "Treta Yuga",
            "sloka": null,
            "festival": "Bhairava Ashtami",
            "about": "A fierce and terrifying form of Shiva, who is also the protector of devotees and the destroyer of evil. He is often depicted with a dog as his mount and a trident as his weapon. He is also associated with time, death, and the secrets of Tantra. He has eight manifestations, known as the Ashta Bhairavas, who guard the eight directions."
        },
        {
            "id": 5,
            "name": "Ashwatthama",
            "books": [
                "Mahabharata"
            ],
            "image": "Ashwathama.png",
            "temples": [
                "Ashwatthama Temple in Haryana",
                "Ashwatthama Temple in Gujarat"
            ],
            "yug": "Dwapara Yuga",
            "sloka": null,
            "festival": null,
            "about": "A partial incarnation of Shiva, who was born as the son of Dronacharya, the royal guru of the Pandavas and Kauravas in the Mahabharata. He was a great warrior and a friend of Duryodhana, the leader of the Kauravas. He fought on the side of the Kauravas in the Kurukshetra war and committed many atrocities. He was cursed by Lord Krishna to roam the earth for eternity with a wound on his forehead that would never heal."
        },
        {
            "id": 6,
            "name": "Hanuman",
            "books": [
                "Ramayana",
                "Mahabharata"
            ],
            "image": "Hanuman.png",
            "temples": [
                "Hanuman Temple in Delhi",
                "Sri Panchamukha Anjaneya Swami Temple in Karnataka"
            ],
            "yug": "Treta Yuga",
            "festival": "Hanuman Jayanti",
            "sloka": null,
            "about": "A partial incarnation of Shiva, who was born as the son of Anjana, a celestial nymph, and Kesari, a monkey king. He was also blessed by Vayu, the wind god, who gave him extraordinary powers. He was a devout follower of Lord Rama, the avatar of Vishnu, and helped him in his quest to rescue his wife Sita from Ravana, the demon king of Lanka. He is revered as a symbol of devotion, strength, courage, and loyalty."
        },
        {
            "id": 7,
            "name": "Keerateshwar",
            "books": [
                "Mahabharata"
            ],
            "festival": "",
            "image": "Kirat.jpg",
            "temples": [
                "Keerateshwar Temple in Nepal",
                "Keerateshwar Temple in West Bengal"
            ],
            "yug": "Dwapara Yuga",
            "sloka": null,
            "about": "Lord Shiva took birth as Keerateshwar to test the bravery and devotion of Arjuna, the Pandava prince. He appeared as a hunter and challenged Arjuna to a duel over a wild boar that they both claimed to have killed. He defeated Arjuna and broke his bow and arrows. He then revealed his true identity and blessed Arjuna with the Pashupatastra, a powerful weapon that could destroy any enemy."
        },
        {
            "id": 8,
            "name": "Rishi Durvasa",
            "books": [
                "Mahabharata",
                "Bhagavata Purana"
            ],
            "image": "Durvasa.jpg",
            "temples": null,
            "yug": "Dwapara Yuga",
            "sloka": null,
            "about": "A partial incarnation of Shiva, who was born as the son of Atri and Anasuya, two sages. He was known for his short temper and his curses, which often caused trouble for gods and humans alike. He also tested the devotion and patience of many people, such as Ambarisha, Draupadi, and Krishna."
        },
        {
            "id": 9,
            "name": "Grihapati",
            "books": null,
            "temples": null,
            "image": "Grihpati.jpg",
            "yug": "Dwapara Yuga",
            "sloka": null,
            "about": "Lord Shiva took birth as Grihapati to test the chastity of his wife Parvati, who was reborn as Anjani, a fisherman’s daughter. He disguised himself as a fisherman and married Anjani, who remained faithful to him despite his poverty and hardships. He later revealed his true identity and blessed her with a son, Hanuman."
        },
        {
            "id": 10,
            "name": "Yatinath",
            "books": null,
            "temples": null,
            "festival": "",
            "image": "Yatinath.jpg",
            "yug": "Dwapara Yuga",
            "sloka": null,
            "about": " Lord Shiva took birth as Yatinath to teach a lesson to a proud king named Arjuna (not to be confused with the Pandava prince). He appeared as a wandering ascetic and challenged Arjuna to a duel. He defeated Arjuna and humbled him by showing him his cosmic form. He then blessed Arjuna with wisdom and devotion."
        },
        {
            "id": 11,
            "name": "Krishna Darshan",
            "books": [
                "Mahabharata"
            ],
            "festival": "",
            "image": "Krishna-darshan.jpg",
            "temples": null,
            "yug": " Dwapara Yuga",
            "sloka": null,
            "about": " Lord Shiva took birth as Krishna Darshan to grant a boon to his devotee, Barbarika, the son of Ghatotkacha and grandson of Bhima. Barbarika had vowed to fight on the side of the weaker army in the Kurukshetra war, but both sides feared his power and asked Krishna to stop him. Krishna disguised himself as a Brahmin and asked Barbarika for his head as a charity. Barbarika agreed, but requested to see the war. Krishna then placed his head on a hilltop, from where he could witness the entire war. After the war, Krishna revealed himself to Barbarika and praised his sacrifice."
        },
        {
            "id": 12,
            "name": "Avadhoot",
            "books": null,
            "temples": null,
            "yug": "Dwapara Yuga",
            "festival": "",
            "image": "Avadhut.jpg",
            "sloka": null,
            "about": "Lord Shiva took birth as Avadhoot to teach the four Kumaras, the sons of Brahma, the essence of Shaivism. He appeared as a naked ascetic with matted hair and a trident. He imparted the knowledge of the Vedas, the Upanishads, and the Agamas to the Kumaras, who became enlightened and devoted to Shiva."
        },
        {
            "id": 13,
            "name": "Sureshwar",
            "books": null,
            "temples": null,
            "yug": "Dwapara Yuga",
            "festival": "",
            "image": "sureshwar.jpg",
            "sloka": null,
            "about": " Lord Shiva took birth as Sureshwar to save his devotee, Markandeya, from the clutches of Yama, the god of death. Markandeya was destined to die at the age of 16, but he was a staunch worshipper of Shiva. He clung to the Shiva Linga when Yama came to take his life. Shiva then appeared as Sureshwar and kicked Yama away, granting Markandeya immortality."
        },
        {
            "id": 14,
            "name": "Sunatnartak",
            "books": null,
            "temples": null,
            "yug": "Dwapara Yuga",
            "festival": "",
            "image": "sunatnartak.jpg",
            "sloka": null,
            "about": " Lord Shiva took birth as Sunatnartak to test the devotion of his wife Parvati, who was reborn as Parvati, the daughter of Himavan. He appeared as a handsome dancer and tried to seduce Parvati, who was performing penance to please Shiva. Parvati recognized him and remained faithful to him. He then revealed his true identity and married her."
        },
        {
            "id": 15,
            "name": "Brahmachari",
            "books": [
                "Ramayana"
            ],
            "temples": null,
            "festival": "",
            "image": "Bhramhachari.jpg",
            "yug": " Treta Yuga",
            "sloka": null,
            "about": " Lord Shiva took birth as Brahmachari to help Lord Rama, the avatar of Vishnu, in his war against Ravana, the demon king of Lanka. He appeared as a young ascetic and taught Rama the Aditya Hridayam, a hymn in praise of the sun god Surya. He also gave Rama a divine arrow called Brahmastra, which was instrumental in killing Ravana."
        },
        {
            "id": 16,
            "name": "Rudra",
            "books": [
                "Ramayana"
            ],
            "festival": "",
            "image": "Rudra.jpg",
            "temples": null,
            "yug": "Treta Yuga",
            "sloka": null,
            "about": " Lord Shiva took birth as Rudra to help Lord Rama, the avatar of Vishnu, in his war against Ravana, the demon king of Lanka. He appeared as a monkey warrior and became the chief of the Kishkindha kingdom after killing his brother Vali. He was a loyal friend and ally of Rama and helped him in building the bridge to Lanka and fighting Ravana’s army."
        },
        {
            "id": 17,
            "name": "Dattatreya",
            "books": [
                "Mahabharata",
                "Bhagavata Purana",
                "Dattatreya Upanishad"
            ],
            "temples": [
                "Dattatreya Temple in Maharashtra",
                "Dattatreya Temple in Gujarat"
            ],
            "festival": "",
            "image": "dattatrey.jpg",
            "yug": "Varies",
            "sloka": "Sarva Aparaadha Naashaaya Sarva Paapa Haraaya Cha | Deva Devaaya Devaaya Sri Dattatreya Namosthuthe ||",
            "about": "Dattatreya is a paradigmatic Sannyasi (monk) and one of the lords of yoga, venerated as a Hindu god. He is considered to be an avatar and combined form of the three Hindu gods Brahma, Vishnu, and Shiva, who are also collectively known as the Trimurti, and the manifestation of the Supreme Brahman. He is depicted with three heads, six hands, and four dogs as his companions. He taught the secrets of yoga, tantra, and Vedanta to many disciples, such as Parashurama, Prahlada, and Kartavirya Arjuna. He is also regarded as the guru of all gurus and the incarnation of the Absolute One. He was born to the sage Atri and his wife Anasuya, who had prayed to the Trimurti for a son. He is worshipped as the source of creation, protection, and destruction. He also symbolizes love, devotion, and marital bliss."
        },
        {
            "id": 18,
            "name": "Yaksheshwar",
            "books": null,
            "temples": null,
            "yug": "Varies",
            "festival": "",
            "image": "Yakseshwar.jpg",
            "sloka": null,
            "about": "Lord Shiva took birth as Yaksheshwar to crush the pride of the Devas after they consumed Amrit, the divine nectar. He asked them to cut a blade of grass, and they failed to destroy it even with their combined powers. Subsequently, they apologized to Lord Shiva and realized his supremacy. Yaksheshwar is also known as Yaksha, who is the lord of wealth and prosperity. He is depicted with a plump body, a round face, and a moustache. He holds a mace, a lotus, a pomegranate, and a bag of jewels in his four hands. He is also the leader of the Yakshas, who are nature spirits that guard the treasures of the earth."
        },
        {
            "id": 19,
            "name": "Ayyapan Avatar of Sankar",
            "books": 
                "Ayyappan: The Lord of Shabarimala,Ayyappan: The Complete Story",
            "festival":"",
            "image":"Ayyapan.jpg",
            "temples": 
                "Sabarimala Temple",
            "yug": "Treta Yuga",
            "sloka": "Swamiye Saranam Ayyappa",
            "about": "Ayyappan is a Hindu deity popular in Southern India. He is considered to be the epitome of dharma, truth, and righteousness and is often called upon to obliterate evil. Although devotion to Ayyappan has been prevalent earlier in South India, his popularity rose only in the late 20th century."
        }
    ]
}